Repository: mizzymi/EcoPulse
Catalog: app/lib/l10n/app_*.arb
Languages: ca, gl

source: My accounts
ca: Els meus comptes
gl: As miñas contas

# createAccount
source: Create an account
ca: Crear un compte
gl: Crear unha conta

# joinAccountByCode
source: Join an account by code
ca: Unir-se a un compte amb codi
gl: Unirse a unha conta por código

# createdAccount
source: Account created: {name}
ca: Compte creat: {name}
gl: Conta creada: {name}

source: Log out
ca: Tanca sessió
gl: Pechar sesión

source: Log in
gl: Iniciar sesión

source: Loading…
ca: Carregant…
gl: Cargando…

source: Cancel
ca: Cancel·lar
gl: Cancelar

source: Save
ca: Desar
gl: Gardar

source: Delete
ca: Eliminar
gl: Borrar

source: Settings
ca: Ajustos
gl: Axustes

# myHouseholdsTitle
source: My accounts
ca: Els meus comptes
gl: As miñas contas

# noHouseholdsMessage
source: You don't belong to any account yet.
ca: Encara no pertanys a cap compte.
gl: Aínda non pertences a ningunha cuenta.

# currencyLabel
source: Currency: {code}
ca: Moneda: {code}
gl: Moeda: {code}

# unnamedAccount
source: account
ca: compte
gl: conta

source: Error loading
ca: Error en carregar
gl: Erro ao cargar

# roleOwner
source: Owner
ca: Propietari
gl: Propietario

# roleMember
source: Member
ca: Membre
gl: Membro

# joinRequestsTitle
source: Pending requests
ca: Sol·licituds pendents
gl: Solicitudes pendentes

# noJoinRequests
source: There are no requests
ca: No hi ha sol·licituds
gl: Non hai solicitudes

source: Request approved
ca: Sol·licitud aprovada
gl: Solicitude aprobada

source: Request rejected
ca: Sol·licitud rebutjada
gl: Solicitude rexeitada

source: Network error
ca: Error de xarxa
gl: Erro de rede

# errorWithMessage
source: Error: {message}
gl: Erro: {message}

source: Reject
ca: Rebutjar
gl: RexeitAR

source: Approve
ca: Aprovar
gl: Aprobar

# joinByCodeTitle
source: Join an account
ca: Unir-se a un compte
gl: Unirse a unha conta

# codeFieldLabel
source: Code (e.g. {example})
ca: Codi (ex. {example})
gl: Código (ex. {example})

# joinAction
source: Join
ca: Unir-me
gl: Unirme

# statusLabel
source: Status: {status}
ca: Estat: {status}
gl: Estado: {status}

# requestSentTitle
source: Request sent
ca: Sol·licitud enviada
gl: Solicitude enviada

# requestSentBody
source: It's pending validation. We'll notify you when it's approved.
ca: Ha quedat pendent de validació. T'avisarem quan s'aprovi.
gl: Queda pendente de validación. Avisarémoste cando se aprobe.

# joinedToast
source: Joined the account!
ca: Unit al compte!
gl: ¡Unido á conta!

# codeMustBe8
source: The code must have 8 characters
ca: El codi ha de tenir 8 caràcters.
gl: O código debe ter 8 caracteres.

# errorLoadData
source: Error loading data
ca: Error en carregar dades
gl: Erro ao cargar datos

# incomeSavedToast
source: Income saved
ca: Ingrés desat
gl: Ingreso gardado

# expenseSavedToast
source: Expense saved
ca: Despesa desada
gl: Gasto gardado

# updatedNameToast
source: Name updated
ca: Nom actualitzat
gl: Nome actualizado

# addEntryFab
source: Add
ca: Afegir
gl: Engadir

# noMonthsWithMovements
source: There are no months with movements.
ca: No hi ha mesos amb moviments.
gl: Non hai meses con movementos.

# monthMovementsTitle
source: Movements of the month
ca: Moviments del mes
gl: Movementos do mes

# deleteFailedToast
source: Could not delete
ca: No s'ha pogut eliminar
gl: Non se puido borrar a conta

# accountGenericLower
source: account
ca: compte
gl: conta

# inviteTitleWithName
source: Invite to "{name}"
ca: Convidar a "{name}"
gl: Invitar a "{name}"

# generateInviteTitle
source: Generate invitation code
ca: Generar codi d'invitació
gl: Xerar código de invitación

# pendingRequestsTooltip
source: Pending requests
ca: Sol·licituds pendents
gl: Solicitudes pendentes

# expiresHoursLabel
source: Expiration (hours)
ca: Caducitat (hores)
gl: Caducidade (horas)

# expiresHoursHint
source: e.g. 48
ca: Ex. 48
gl: Ex. 48

# expiresHoursEmpty
source: Enter the number of hours
ca: Escriu les hores
gl: Escribe as horas

# expiresHoursRange
source: Between 1 and 720 hours
ca: Entre 1 i 720 hores
gl: Entre 1 e 720 horas

# maxUsesLabel
source: Maximum uses
ca: Usos màxims
gl: Usos máximos

# maxUsesHint
source: e.g. 10
ca: Ex. 10
gl: Ex. 10

# maxUsesEmpty
source: Enter a number
ca: Escriu un número
gl: Escribe un número

# maxUsesRange
source: Between 1 and 999
ca: Entre 1 i 999
gl: Entre 1 e 999

# requireApprovalTitle
source: Require admin approval
ca: Requereix aprovació de l'administrador
gl: Require aprobación do administrador

# requireApprovalSubtitle
source: If enabled, joins will remain in PENDING
ca: Si està actiu, les unions quedaran en PENDING
gl: Se está activo, as unións quedarán en PENDING

# generateCodeButton
source: Generate code
ca: Generar codi
gl: Xerar código

# codeGeneratedTitle
source: Code generated
ca: Codi generat
gl: Código xerado

# expiresAtLabel
source: Expires: {date}
ca: Caduca: {date}
gl: Caduca: {date}

# copyCodeButton
source: Copy
ca: Copiar
gl: Copiar

# codeCopiedToast
source: Code copied
ca: Codi copiat
gl: Código copiado

# doneButton
source: Done
ca: Fet
gl: Listo

# generateAnotherButton
source: Generate another code
ca: Generar un altre codi
gl: Xerar outro código

# errorGenerateCode
source: Error generating code
ca: Error en generar el codi
gl: Erro ao xerar o código

# createAccountTitle
source: Create account
ca: Crear compte
gl: Crear conta

# accountNameLabel
source: Account name
ca: Nom del compte
gl: Nome da conta

# accountNameHint
source: e.g. Can Crustons
ca: Ex. Can Crustons
gl: Ex. Can Crustons

# nameEmpty
source: Enter a name
ca: Escriu un nom
gl: Escribe un nome

# nameMinChars
source: Minimum 3 characters
ca: Mínim 3 caràcters
gl: Mínimo 3 caracteres

# currencyIsoLabel
source: Currency (ISO-4217)
ca: Moneda (ISO-4217)
gl: Moeda (ISO-4217)

# currencyIsoInvalid
source: Use a 3-letter code (e.g. EUR)
ca: Fes servir un codi de 3 lletres (ex. EUR)
gl: Usa un código de 3 letras (ex. EUR)

# createAccountCta
source: Create account
ca: Crear compte
gl: Crear conta

# accountCreatedToast
source: Account created successfully
ca: Compte creat correctament
gl: Conta creada correctamente

# errorCreateAccount
source: Error creating the account
ca: Error en crear el compte
gl: Erro ao crear a conta

# summaryTitle
source: Summary {month}
ca: Resum {month}
gl: Resumo {month}

# netOfMonth
source: Net of month: {amount}
ca: Nete del mes: {amount}
gl: Neto do mes: {amount}

# openingOfMonth
source: Opening: {amount}
ca: Inici de mes: {amount}
gl: Inicio de mes: {amount}

# expensesLabel
source: Expenses: {amount}
ca: Despeses: {amount}
gl: Gastos: {amount}

# incomeLabel
source: Income: {amount}
ca: Ingressos: {amount}
gl: Ingresos: {amount}

# noMovementsThisMonth
source: There are no movements this month.
ca: No hi ha moviments aquest mes.
gl: Non hai movementos este mes.

# incomeGeneric
source: Income
ca: Ingrés
gl: Ingreso

# expenseGeneric
source: Expense
ca: Despesa
gl: Gasto

# deleteMovementTitle
source: Delete movement
ca: Eliminar moviment
gl: Eliminar movemento

# deleteMovementConfirm
source: Are you sure you want to delete it?
ca: Segur que vols eliminar-lo?
gl: Seguro que queres eliminalo?

# deleteAction
source: Delete
ca: Eliminar
gl: Eliminar

# deletedToast
source: Deleted
ca: Eliminat
gl: Eliminado

# prevMonthTooltip
source: Previous month
ca: Mes anterior
gl: Mes anterior

# nextMonthTooltip
source: Next month
ca: Mes següent
gl: Mes seguinte

# seeAllMonthsTooltip
source: See all months
ca: Veure tots els mesos
gl: Ver todos os meses

# seeCurrentMonthTooltip
source: See current month
ca: Veure mes actual
gl: Ver mes actual

# allMonthsTitle
source: All months
ca: Tots els mesos
gl: Todos os meses

# newMovementTitle
source: New movement
ca: Nou moviment
gl: Novo movemento

# editMovementTitle
source: Edit movement
ca: Editar moviment
gl: Editar movemento

# amountLabel
source: Amount
ca: Import
gl: Importe

# amountHint
source: e.g. 25.50
ca: Ex. 25.50
gl: Ex. 25.50

# categoryOptionalLabel
source: Category (optional)
ca: Categoria (opcional)
gl: Categoría (opcional)

# categoryOptionalHint
source: Food, Transport, Payroll…
ca: Menjar, Transport, Nòmina…
gl: Comida, Transporte, Nómina…

# noteOptionalLabel
source: Note (optional)
ca: Nota (opcional)
gl: Nota (opcional)

# dateLabel
source: Date: {date}
ca: Data: {date}
gl: Data: {date}

# changeDate
source: Change
ca: Canviar
gl: Cambiar

source: Save changes
ca: Desar canvis
gl: Gardar cambios

# invalidAmountToast
source: Invalid amount
ca: Import no vàlid
gl: Importe non válido

# errorSave
source: Error while saving
ca: Error en desar
gl: Erro ao gardar

# savingsTooltip
source: Savings
ca: Estalvi
gl: Aforro

# quickSavingsDepositTooltip
source: Savings deposit
ca: Ingrés a l'estalvi
gl: Ingreso en aforro

# generateCodeTooltip
source: Generate code
ca: Generar codi
gl: Xerar código

# membersTooltip
source: Members
ca: Membres
gl: Membros

# settingsTooltip
source: Settings
ca: Configurar
gl: Configurar

# movementsChartTooltip
source: Movements chart
ca: Gràfica de moviments
gl: Gráfica de movementos

# refreshTooltip
source: Refresh
ca: Actualitzar
gl: Actualizar

# cumulativeTitle
source: Cumulative balance {name}
ca: Saldo acumulat {name}
gl: Saldo acumulat {name}

# householdGeneric
source: Household
ca: Casa
gl: Casa

# groupByTooltip
source: Group by
ca: Agrupar per
gl: Agrupar per

# groupByDay
source: Day
ca: Dia
gl: Dia

# groupByWeek
source: Week
ca: Setmana
gl: Setmana

# groupByMonth
source: Month
ca: Mes
gl: Mes

# noMovementsToChart
source: There are no movements to chart.
ca: No hi ha moviments per representar.
gl: No hi ha moviments per representar.

# legendCumulativeBalance
source: Cumulative balance
ca: Saldo acumulat
gl: Saldo acumulat

# periodsEntriesLabel
source: Periods: {periods} • Entries: {entries}
ca: Períodes: {periods} • Entrades: {entries}
gl: Períodes: {periods} • Entrades: {entries}

# balanceLabel
source: Balance: {amount}
ca: Saldo: {amount}
gl: Saldo: {amount}

# loadMovementsFailed
source: Couldn't load movements
ca: No s'han pogut carregar els moviments
gl: No s'han pogut carregar els moviments

source: Unexpected error
ca: Error inesperat
gl: Error inesperat

source: Error loading goals
ca: Error en carregar objectius
gl: Erro ao cargar obxectivos

# newSavingsGoalTitle
source: New savings goal
ca: Nova meta d'estalvi
gl: Nova meta de aforro

# nameLabel
source: Name
ca: Nom
gl: Nome

# targetAmountLabel
source: Target amount
ca: Objectiu
gl: Obxectivo

# noDeadlineLabel
source: No deadline
ca: Sense data límit
gl: Sen data límite

# deadlineLabel
source: Deadline: {date}
ca: Límit: {date}
gl: Límite: {date}

# chooseDateButton
source: Choose date
ca: Triar data
gl: Escoller data

# createAction
source: Create
ca: Crear
gl: Crear

# createGoalFailed
source: Couldn't create
ca: No s'ha pogut crear
gl: Non se puido crear

# deleteGoalTitle
source: Delete goal
ca: Eliminar meta
gl: Eliminar meta

# deleteGoalConfirm
source: Delete "{name}" and all its savings movements?
ca: Eliminar «{name}» i tots els seus moviments d'estalvi?
gl: Eliminar «{name}» e todos os seus movementos de aforro?

# deleteGoalForbidden
source: You don't have permission to delete this goal
ca: No tens permisos per eliminar aquesta meta
gl: Non tes permisos para eliminar esta meta

# deleteGoalFailed
source: Couldn't delete
ca: No s'ha pogut eliminar
gl: Non se puido eliminar

# goalDeletedToast
source: Goal "{name}" deleted
ca: Meta «{name}» eliminada
gl: Meta «{name}» eliminada

# goalDeletedSimple
source: Goal deleted
ca: Meta eliminada
gl: Meta eliminada

# savingsTitle
source: Savings – {name}
ca: Estalvi – {name}
gl: Aforro – {name}

# newGoalFab
source: New goal
ca: Nova meta
gl: Nova meta

# noGoalsEmptyState
source: No goals yet. Create the first one with the + button
ca: Sense metes. Crea la primera amb el botó +
gl: Sen metas. Crea a primeira co botón +

# goalGeneric
source: Goal
ca: Meta
gl: Meta

source: Error loading goal
ca: Error en carregar la meta
gl: Erro ao cargar a meta

# addDepositTitle
source: Add deposit
ca: Afegir dipòsit
gl: Engadir depósito

# registerWithdrawalTitle
source: Register withdrawal
ca: Registrar retirada
gl: Rexistrar retirada

# depositRecordedToast
source: Deposit recorded
ca: Dipòsit registrat
gl: Depósito rexistrado

# withdrawalRecordedToast
source: Withdrawal recorded
ca: Retirada registrada
gl: Retirada rexistrada

# savingsGoalTitle
source: Savings goal: {name}
ca: Estalvi: {name}
gl: Aforro: {name}

# depositAction
source: Deposit
ca: Dipòsit
gl: Depósito

# withdrawalAction
source: Withdrawal
ca: Retirada
gl: Retirada

# savingsMovementsTitle
source: Savings movements
ca: Moviments d'estalvi
gl: Movementos de aforro

# noSavingsTransactions
source: There are no transactions yet.
ca: Encara no hi ha transaccions.
gl: Aínda non hai transaccións.

# errorLoadingMembers
source: Couldn't load members
ca: No s'han pogut carregar els membres
gl: Non se puideron cargar os membros

# membersTitle
source: Members — {name}
ca: Membres — {name}
gl: Membros — {name}

# membersTitleSimple
source: Members
ca: Membres
gl: Membros

# sinceLabel
source: Since: {date}
ca: Des de: {date}
gl: Desde: {date}

# noMembers
source: No members yet
ca: Encara no hi ha membres
gl: Aínda non hai membros

# userGeneric
source: User
ca: Usuari
gl: Usuario

# noSavingsGoalsTitle
source: No savings goals
ca: Sense metes d'estalvi
gl: Sen metas de aforro

# createGoalFirstMsg
source: Create a goal first to record deposits.
ca: Crea primer una meta per poder registrar dipòsits.
gl: Crea primeiro unha meta para poder rexistrar depósitos.

# quickSavingsDepositTitle
source: Savings deposit
ca: Ingrés a l'estalvi
gl: Ingreso en aforro

# goalLabel
source: Goal
ca: Meta
gl: Meta

# selectGoalFirst
source: Select a goal
ca: Selecciona una meta
gl: Selecciona unha meta

# depositRegisterFailed
source: Couldn't register the deposit
ca: No s'ha pogut registrar el dipòsit
gl: Non se puido rexistrar o depósito

# renameHouseholdTitle
source: Rename account
ca: Canviar el nom del compte
gl: Cambiar o nome da conta

# nameHint
source: e.g. Downtown flat
ca: Ex. Pis Centre
gl: Ex. Piso Centro

# nameEmptyToast
source: The name cannot be empty
ca: El nom no pot estar buit
gl: O nome non pode estar baleiro

# updateNameFailed
source: Couldn't update the name
ca: No s'ha pogut actualitzar el nom
gl: Non se puido actualizar o nome

# loginTitle
source: Sign in
ca: Inicia sessió
gl: Iniciar sesión

# registerTitle
source: Create account
ca: Crear compte
gl: Crear conta

# passwordLabel
source: Password
ca: Contrasenya
gl: Contrasinal

# loginAction
source: Sign in
ca: Entrar
gl: Entrar

# registerAction
source: Sign up
ca: Registrar-me
gl: Rexistrarme

# noAccountCta
source: Don't have an account? Create one
ca: No tens compte? Crea'n un
gl: Non tes conta? Crea unha

# alreadyAccountCta
source: Already have an account? Sign in
ca: Ja tens compte? Inicia sessió
gl: Xa tes conta? Inicia sesión

# forgotPasswordCta
source: Forgot your password?
ca: Has oblidat la contrasenya?
gl: Esqueciches o contrasinal?

# haveCodeCta
source: I already have a code
ca: Ja tinc un codi
gl: Xa teño un código

source: Enter your email
ca: Introdueix el teu correu
gl: Introduce o teu email

source: Invalid email
ca: Correu no vàlid
gl: Email non válido

# minPasswordLen
source: Minimum 6 characters
ca: Mínim 6 caràcters
gl: Mínimo 6 caracteres

# authErrorGeneric
source: Authentication error
ca: Error d'autenticació
gl: Erro de autenticación

# missingTokenResponse
source: Response without token
ca: Resposta sense testimoni
gl: Resposta sen token

# loginSuccess
source: Signed in
ca: Sessió iniciada
gl: Sesión iniciada

# registerSuccess
source: Registration completed
ca: Registre completat
gl: Rexistro completado

# forgotPasswordTitle
source: Recover password
ca: Recuperar contrasenya
gl: Recuperar contrasinal

# sendResetLink
source: Send link/code
ca: Enviar enllaç/codi
gl: Enviar ligazón/código

# forgotPasswordFailed
source: Couldn't start recovery
ca: No s'ha pogut iniciar la recuperació
gl: Non se puido iniciar a recuperación

# forgotPasswordAfterMsg
source: If the email exists, we sent you instructions to recover your password.
ca: Si el correu existeix, t'hem enviat instruccions per recuperar la contrasenya.
gl: Se o email existe, enviámosche instrucións para recuperar o contrasinal.

# resetPasswordTitle
source: Reset password
ca: Restablir contrasenya
gl: Restablecer contrasinal

# codeTokenLabel
source: Code / Token
ca: Codi / Testimoni
gl: Código / Token

# newPasswordLabel
source: New password
ca: Nova contrasenya
gl: Novo contrasinal

# changeAction
source: Change
ca: Canviar
gl: Cambiar

# resetPasswordFailed
source: Couldn't reset
ca: No s'ha pogut restablir
gl: Non se puido restablecer

# passwordUpdatedToast
source: Password updated. Sign in.
ca: Contrasenya actualitzada. Inicia sessió.
gl: Contrasinal actualizado. Inicia sesión.

# emailLabel
source: Email
ca: Correu
